app/views/devise/registrations/new.html.erb

      <%= f.label :city %>
      <%= f.select :city_id, options_for_select(City.all.collect { |city|
        ["#{city.name} (#{city.short_name})", city.id] }, 0), {}, { id: 'cities_select' } %>
---
SELECT "cities".* FROM "cities"