app/controllers/cities_controller.rb

SELECT  "cities".* FROM "cities" LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "cities"
---
  def index
    @cities = City.all.page(params[:page])

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @city = City.find(params[:id])

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @city = City.find(params[:id])

INSERT INTO "cities" ("name", "short_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Warsaw"], ["short_name", "Waw"], ["created_at", "2015-02-28 14:45:24.614847"], ["updated_at", "2015-02-28 14:45:24.614847"]]
---
  def create
    @city = City.create(city_params)

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "cities" SET "name" = ?, "short_name" = ?, "updated_at" = ? WHERE "cities"."id" = ?  [["name", "Krakow"], ["short_name", "Krk"], ["updated_at", "2015-02-28 16:45:12.121106"], ["id", 3]]
---
  def update
    @city = City.find(params[:id])
    @city.update(city_params)

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "cities" WHERE "cities"."id" = ?  [["id", 1]]
---
  def destroy
    @city = City.find(params[:id])
    @city.destroy