app/controllers/users_controller.rb

  def index
    @users = User.all.page(params[:page])
---
SELECT  "users".* FROM "users" LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "users"

  def show
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]